In [3]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("tips")
df['sex_str'] = df['sex'].astype(str)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 9.3+ KB

In [5]:
df['tip_int'] = df['tip'].astype(int)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
 8   tip_int     244 non-null    int32
dtypes: category(4), float64(2), int32(1), int64(1), object(1)
memory usage: 10.2+ KB

In [7]:
df['tip_int'] = df['tip'].astype(int)
df['tip_float'] = df['tip'].astype(float)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
 8   tip_int     244 non-null    int32
 9   tip_float   244 non-null    float64
dtypes: category(4), float64(3), int32(1), int64(1), object(1)
memory usage: 12.1+ KB

In [10]:
df.loc[[1, 3, 5, 7], 'total_bill'] = 'missing'

In [11]:
df

,total_bill,tip,sex,smoker,day,time,size,sex_str,tip_int,tip_float
0,16.99,1.01,Female,No,Sun,Dinner,2,Female,1,1.01
1,missing,missing,Male,No,Sun,Dinner,3,Male,1,1.66
2,21.01,3.5,Male,No,Sun,Dinner,3,Male,3,3.50
3,missing,missing,Male,No,Sun,Dinner,2,Male,3,3.31
4,24.59,3.61,Female,No,Sun,Dinner,4,Female,3,3.61
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,Male,5,5.92
240,27.18,2.0,Female,Yes,Sat,Dinner,2,Female,2,2.00
241,22.67,2.0,Male,Yes,Sat,Dinner,2,Male,2,2.00
242,17.82,1.75,Male,No,Sat,Dinner,2,Male,1,1.75
243,18.78,3.0,Female,No,Thur,Dinner,2,Female,3,3.00

In [12]:
df['total_bill'] = pd.to_numeric(df['total_bill'], errors='coerce')

In [14]:
df

,total_bill,tip,sex,smoker,day,time,size,sex_str,tip_int,tip_float
0,16.99,1.01,Female,No,Sun,Dinner,2,Female,1,1.01
1,NaN,missing,Male,No,Sun,Dinner,3,Male,1,1.66
2,21.01,3.5,Male,No,Sun,Dinner,3,Male,3,3.50
3,NaN,missing,Male,No,Sun,Dinner,2,Male,3,3.31
4,24.59,3.61,Female,No,Sun,Dinner,4,Female,3,3.61
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,Male,5,5.92
240,27.18,2.0,Female,Yes,Sat,Dinner,2,Female,2,2.00
241,22.67,2.0,Male,Yes,Sat,Dinner,2,Male,2,2.00
242,17.82,1.75,Male,No,Sat,Dinner,2,Male,1,1.75
243,18.78,3.0,Female,No,Thur,Dinner,2,Female,3,3.00

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  240 non-null    float64
 1   tip         244 non-null    object
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex_str     244 non-null    object
 8   tip_int     244 non-null    int32
 9   tip_float   244 non-null    float64
dtypes: category(4), float64(2), int32(1), int64(1), object(2)
memory usage: 12.1+ KB

In [17]:
df = sns.load_dataset("tips")

In [19]:
df['total_bill'] = pd.to_numeric(df['total_bill'], errors='coerce', downcast='float')

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float32
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float32(1), float64(1), int64(1)
memory usage: 6.4 KB

In [23]:
df['sex'] = df['sex'].astype(str)
df['sex'] = df['sex'].astype('category')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float32
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float32(1), float64(1), int64(1)
memory usage: 6.4 KB

In [26]:
word = 'Layla'
sent = 'Layla is cute'
print(word[0])
print(sent[0])

L
L

In [28]:
sent[0:5]

'Layla'

In [29]:
text = 'the Layla is cute because she was cute'
text[0:len(text)]

'the Layla is cute because she was cute'

In [34]:
text[-7:-3]

'as c'

In [36]:
text[-3:]

'ute'

In [37]:
word[0:3]

'Lay'

In [38]:
word[:3]

'Lay'

In [40]:
sent[4:]

'a is cute'

In [41]:
sent[ : ]

'Layla is cute'

In [42]:
sent[::2]

'Lyai ue'

In [43]:
a =  'Name : Layla' 
b =  'StudentID : 20231111' 
c =  'Hobby : “Study”' 
d =  'Comment : cute'

In [45]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : “Study” Comment : cute'

In [46]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden : Yes!
Guard: You're using coconuts!
Queen Raiden : What?
Guard: You've Got . . . coconuts[s] and you're banagin' em together
"""
strs

"Guard: What? Ridden en a horse?\nQueen Raiden : Yes!\nGuard: You're using coconuts!\nQueen Raiden : What?\nGuard: You've Got . . . coconuts[s] and you're banagin' em together\n"

In [48]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconuts!",
 "Guard: You've Got . . . coconuts[s] and you're banagin' em together"]

In [50]:
import ipyc

ModuleNotFoundError: No module named 'ipyc'

In [53]:
str(strs.splitlines()[::2]).replace("Guard", "Yae Miko")

'[\'Yae Miko: What? Ridden en a horse?\', "Yae Miko: You\'re using coconuts!", "Yae Miko: You\'ve Got . . . coconuts[s] and you\'re banagin\' em together"]'

In [54]:
std = "{} is cute"
std.format('Layla')

'Layla is cute'

In [57]:
text = """{0}은 매우매우 착하고 귀엽고 사랑스럽습니다
이 사악한 {1}는 {0}을 괴롭히는 원인 중 하나입니다."""

print(text.format('레일라', '나히다'))

레일라은 매우매우 착하고 귀엽고 사랑스럽습니다
이 사악한 나히다는 레일라을 괴롭히는 원인 중 하나입니다.

In [60]:
print("나히다는 {age}살 이상이다.".format(age = 500))
print(f'나히다는 {500}살 이상이다.')
print('나히다는 {}살 이상이다.'.format(500))

나히다는 500살 이상이다.
나히다는 500살 이상이다.
나히다는 500살 이상이다.

In [61]:
"In 2005, {:,}".format(182818818)

'In 2005, 182,818,818'

In [62]:
"나는 {:,} 살까지 살고 싶다.".format(9999999999999999999999999999999999999)

'나는 9,999,999,999,999,999,999,999,999,999,999,999,999 살까지 살고 싶다.'